{"inkVersion":19,"root":[[["^I wipe down the counter for the fifteenth time today. It's so hard to believe that in only a few days the grand opening is coming! Finally my tea shop will be open! I've been waiting for as long as I can remember for this moment.My mother bought this tea shop when she was my age and it was the greatest tea shop in town. People from miles and miles around would come to try her famous Gold Leaf Tea and she loved it. One day, she just closed shop with almost no noticed. She didn't tell anyone, even her own mother. Of course, I was born after all of this happened, but ever since I first saw a picture of what this tea shop used to be when I was five years old, I knew I wanted to reopen it no matter how I would do it.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"0.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^I raised enough money to buy the shop a lot faster than I thought. After years of bussing tables, manning cash registers, and serving grumpy old men, I finally did it. Surprisingly, the shop wasn't that expensive. No one seemed to want this enchanting place. Sure, it's a little rough around the edges, but at the end of the day, it feels more like home to me than any other place I've ever lived.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":"0.g-2"},{"#f":7}],"#f":7}],"g-2":["^(*shop keeper's bell rings at door*)","\n",["^\"Mom! What are you doing here?\" I ask her. She walks in, taking in the shop. It's probably been years since she's actually been inside. She wasn't exactly thrilled that I used my hard earned money to buy the shop back.","\n",["^\"You think I would miss my baby's grand opening?\" she said, smiling gently.","\n",["^\"The opening isn't even for a few days! There's still so much to do before I officially open...\" I remind her. The last couple of years, mom's health has been deteriorating a bit. She walks slower and forgets more and more things, but she's doing better than her mother did at her age.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n",{"->":"0.g-6"},{"#f":7}],"#f":7,"#n":"g-5"}],{"#f":7,"#n":"g-4"}],{"#f":7,"#n":"g-3"}],{"#f":7}],"g-6":["^\"Oh that's right,\" she remembers, picking at a piece of dust near the old cash register. \"Are you absolutely sure that this is what you want to do? Don't worry about the money. I can get you your money back and you'll be out of this in no time-\" she rushes out.","\n",["^\"Mom, stop! Of course I do. It's my dream,\" I tell her for the fifth time this week. My mom has been asking me this same question almost every day ever since I put down my first deposit.","\n",["^\"You're far too young to be living your dream. You need to have more experiences first. You've hardly lived! You're hardly 20 and you've already settled down. It's not right for a young person like you,\" she tells me, scolding me like I'm 10 years old.","\n",["^I take her hand to stop her frantic speaking. \"I am sure mother. I'm excited. I'm doing this for both of us. Why can't you be happy for me?\" I ask her.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"->":"0.g-10"},{"#f":7}],"#f":7,"#n":"g-9"}],{"#f":7,"#n":"g-8"}],{"#f":7,"#n":"g-7"}],{"#f":7}],"g-10":["^She looks at me sadly for a moment and then looks away, starting to dust random corners of the shop that I've already dusted a million times. We clean in silence for a moment. \"Do you have any advice for me? I mean, this is your shop after all...\" I ask her, trying to lighten the mood.","\n",["^\"Oh, honey it's been years since this was my shop. I hardly remember owning the shop,\" she admits.","\n",["^\"Well, can you finally tell me the secret to your Golden Eucalyptus Tea? I thought I should serve it too,\" I tell her proudly.","\n",["^She looks at me seriously for a moment and then smiles. \"You need a Golden Eucalyptus Leaf. I haven't seen one in decades. They're exceedingly rare,\" she tells me. I can feel myself frown, but I try to hide it. I want this place to be perfect, just like her place was.","\n",["^\"That's okay,\" I tell her sadly, lying to her and myself.","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-4","flg":20},{"c-4":["\n",{"->":"0.g-15"},{"#f":7}],"#f":7,"#n":"g-14"}],{"#f":7,"#n":"g-13"}],{"#f":7,"#n":"g-12"}],{"#f":7,"#n":"g-11"}],{"#f":7}],"g-15":["^\"I think I may know where you can find one. I have friends who own their own tea shop and if anyone will know where a Golden Eucalyptus Leaf is, they will,\" she tells me with a wide smile on her face.","\n",["^\"Where are these friends?\" I ask excitedly.","\n",["^\"Well, there are three shops you could visit. Rooibos Road in Kalgoorie, Matcha Made in Heaven in Adelaide, and Aurora Blue Tea House in Sydney,\"","\n",["^\"Those are all in completely different parts of the country!\" I exclaim, mapping out the cities in my head and their distance from tiny Cairns.","\n",["^\"Well you better get a move on!\" she tells me, handing me my backpack.","\n","ev","str","^Go to Rooibos Road","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^Go to Matcha Made in Heaven","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Go to Aurora Blue Tea House","/str","/ev",{"*":".^.c-7","flg":20},{"c-5":["\n",{"->":"rooibos"},{"->":"0.g-20"},{"#f":7}],"c-6":["\n",{"->":"matcha"},{"->":"0.g-20"},{"#f":7}],"c-7":["\n",{"->":"aurora"},{"->":"0.g-20"},{"#f":7}],"#f":7,"#n":"g-19"}],{"#f":7,"#n":"g-18"}],{"#f":7,"#n":"g-17"}],{"#f":7,"#n":"g-16"}],{"#f":7}],"g-20":["done",{"#f":7}]}],"done",{"rooibos":[["ev",1,"/ev",{"VAR=":"beenrooibos","re":true},["^Rooibos Road has a seedy bar-like atmosphere with other people mulling around and sipping drinks out of bottles. Many heads turn when I walk through the door and head to an empty table. I'm definitely not the main clientele. I start to wonder if my mother sent me to the wrong place. I open the menu on the table and confirm that it is in fact a tea house, specializing in black teas. The menu says they're known for the famous Chai tea, but it doesn't seem like anyone is even drinking tea!","\n","ev","str","^NEXT","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.^.g-1"},{"#f":7}],"#f":7,"#n":"g-0"}],{"g-1":["^\"Can I help you, kid?\" a tasmanian devil askes me, holding a tray of empty bottles. I had never met a tasmanian devil in person before. They have reputation of being dangerous and generally keep away from people.","\n",["^My mom wouldn't send me somewhere dangerous... right?","\n","ev","str","^Explain why you're there","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Order tea","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^\"Hi there,\" I nervously say. \"My mom sent me to come talk to you. Her name     is Kathleen... I'm actually opening my own tea sho-\"","\n","^\"You're Kathleen's kid? I shoulda know, you look just like her!\" he interrupts, sitting down at my table. \"The name's Bruce. Your mother worked with my granddad for years at her teahouse! I used to go into that tea house all the time when I was a kid. Can I get you anything? A tea?\"","\n",["ev","str","^Order black tea","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Order chai tea","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^No Thanks","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^\"Can I get an English Breakfast please?\"","\n","^\"Huh, English Breakfast? Not the most interesting choice. Would have thought Kathleen's kid woulda been more adventurous. Hold on kid I'll grab it,\" he says, disappointed in my ordering choice.","\n","^He returns quickly with two bottles in his hand. He hands one to me and takes a sip out of the other one. I take a sip from the bottle, dubious about tea being served in a glass bottle, but find myself surprisingly pleased with the tea.","\n",{"->":"rooibosQuestions"},{"->":"rooibos.0.g-3"},{"#f":7}],"c-1":["\n","^\"Can I try the famous chai tea?\"","\n","^His face lights up. \"Of course!\" He boasts, scurrying away to grab the drink.","\n","^He returns quickly with two bottles in his hand. He hands one to me and takes a sip out of the other one. I take a sip from the bottle, dubious about tea being served in a glass bottle, but find myself surprisingly pleased with the tea.","\n",{"->":"rooibosQuestions"},{"->":"rooibos.0.g-3"},{"#f":7}],"c-2":["\n","^\"No thanks,\" I tell him, ready to get down to business.","\n","^\"Nothing? No tea? Jeez kid why'd you come to a tea house then?\" he askes, sounding a bit bitter.","\n",{"->":"rooibosQuestions"},{"->":"rooibos.0.g-3"},{"#f":7}]}],{"#f":7}],"c-2":["\n","^\"Hi! Um... Can I get a chai tea please?\" I ask, too nervous to tell him about my mother.","\n","^\"That it?\" he askes bruskly.","\n",["ev","str","^Yes","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Actually...","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"rooibos.0.g-3"},{"#f":7}],"c-1":["\n",{"->":"rooibos.0.g-3"},{"#f":7}]}],{"#f":7}],"#f":7,"#n":"g-2"}],{"#f":7}],"g-3":["end",{"#f":7}]}],{"#f":3}],"matcha":["ev",1,"/ev",{"VAR=":"beenmatcha","re":true},"end",{"#f":3}],"aurora":["ev",1,"/ev",{"VAR=":"beenaurora","re":true},"end",{"#f":3}],"rooibosQuestions":[["ev","str","^Ask about Golden Eucalyptus","/str",{"VAR?":"geRooibos"},"!","/ev",{"*":".^.c-0","flg":21},"ev","str","^Ask about Tea House","/str",{"VAR?":"THRooibos"},"!","/ev",{"*":".^.c-1","flg":21},"ev","str","^Ask for Advice","/str",{"VAR?":"adviceRooibos"},"!","/ev",{"*":".^.c-2","flg":21},"ev","str","^Ask about Mother","/str",{"VAR?":"momRooibos"},"!","/ev",{"*":".^.c-3","flg":21},"ev","str","^Leave Rooibos Road","/str",{"VAR?":"momRooibos"},{"VAR?":"adviceRooibos"},"&&",{"VAR?":"THRooibos"},"&&",{"VAR?":"geRooibos"},"&&","/ev",{"*":".^.c-4","flg":21},{"c-0":["\n","ev",1,"/ev",{"VAR=":"geRooibos","re":true},{"->":".^.^.^"},{"#f":7}],"c-1":["\n","ev",1,"/ev",{"VAR=":"THRooibos","re":true},{"->":".^.^.^"},{"#f":7}],"c-2":["\n","ev",1,"/ev",{"VAR=":"adviceRooibos","re":true},{"->":".^.^.^"},{"#f":7}],"c-3":["\n","ev",1,"/ev",{"VAR=":"momRooibos","re":true},{"->":".^.^.^"},{"#f":7}],"c-4":["\n",{"->":"map"},"end",{"#f":7}]}],{"#f":3}],"map":[["ev","str","^Go to Rooibos Road","/str",{"VAR?":"beenrooibos"},"!","/ev",{"*":".^.c-0","flg":21},"ev","str","^Go to Matcha Made in Heaven","/str",{"VAR?":"beenmatcha"},"!","/ev",{"*":".^.c-1","flg":21},"ev","str","^Go to Aurora Blue Tea House","/str",{"VAR?":"beenaurora"},"!","/ev",{"*":".^.c-2","flg":21},"ev","str","^Go Back Home","/str",{"VAR?":"beenrooibos"},{"VAR?":"beenmatcha"},"&&",{"VAR?":"beenaurora"},"&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["\n",{"->":"rooibos"},{"#f":7}],"c-1":["\n",{"->":"matcha"},{"#f":7}],"c-2":["\n",{"->":"aurora"},{"#f":7}],"c-3":["\n",{"->":"home"},"end",{"#f":7}]}],{"#f":3}],"home":["end",{"#f":3}],"global decl":["ev",0,{"VAR=":"beenrooibos"},0,{"VAR=":"beenaurora"},0,{"VAR=":"beenmatcha"},0,{"VAR=":"geRooibos"},0,{"VAR=":"momRooibos"},0,{"VAR=":"adviceRooibos"},0,{"VAR=":"THRooibos"},"/ev","end",null],"#f":3}],"listDefs":{}}